EmbeddedSystemClass/STM32F746G_Base/ESP8266/App/src/ESP8266_handlers_tcp.cpp
/*
 * ESP8266_handlers_common.cpp
 *
 *  Created on: 17/12/2016
 *      Author: Desarrollo 01
 */

#include "ESP8266_handlers_tcp.h"
#include "ESP8266_AT_CMD.h"
#include "ESP8266_Utils.h"
#include "../sensorsHandler.h"
#include "../logHandler.h"

#define TCP_SEND_FSM_DBG (0)

typedef enum
{
    BUILDER_SEND_HTTP_PATH,                   /* +CIPSEND:<len> */
    BUILDER_SEND_HTTP_PATH_DATA,              /* > POST /api/data/ HTTP/1.1 */
    BUILDER_SEND_HEADER_HOST,                 /* +CIPSEND:<len> */
    BUILDER_SEND_HEADER_HOST_DATA,            /* > Host: 192.168.253.31 */
    BUILDER_SEND_HEADER_TOKEN,                /* +CIPSEND:<len> */
    BUILDER_SEND_HEADER_TOKEN_DATA,           /* > X-ARDUINOTOKEN: e5242fe888b7473c871f */
    BUILDER_SEND_HEADER_CONTENT_LENGTH,       /* +CIPSEND:<len> */
    BUILDER_SEND_HEADER_CONTENT_LENGTH_DATA,  /* > Content-Length: 73 */
    BUILDER_SEND_CONTENT,                     /* +CIPSEND:<len> */
    BUILDER_SEND_CONTENT_DATA,                /* > field1=1482369605&field2=26.60&field3=28.00&field4=-127.00&field5=-127.00 */
    BUILDER_FINISHED,
} at_tcp_send_message_order_t;

typedef enum
{
    AT_SEND_WAIT_FOR_OK,
    AT_SEND_WAIT_CURSOR,
    AT_SEND_WAIT_SENDOK,
    AT_SEND_FINISHED,
} at_tcp_send_builder_order_t;


typedef struct
{
        at_tcp_send_message_order_t order;
        char buffer[ESP8266_TCP_SEND_BUFF_LEN];
        uint16_t len;
} tcp_send_scratchpad_t;

#if TCP_SEND_FSM_DBG == 1
static const char* sendLabels[]
{
    "AT_SEND_WAIT_FOR_OK",
    "AT_SEND_WAIT_CURSOR",
    "AT_SEND_WAIT_SENDOK",
    "AT_SEND_FINISHED",
};
#endif

/* Private declarations */
static at_common_message_order_t tcp_start_msg_order = AT_WAITING_FOR_PAYLOAD;
static at_common_message_order_t tcp_start_status_msg_order = AT_WAITING_FOR_PAYLOAD;
static at_common_message_order_t tcp_close_status_msg_order = AT_WAITING_FOR_PAYLOAD;
static at_tcp_send_builder_order_t tcp_send_msg_order = AT_SEND_WAIT_FOR_OK;
static at_common_message_order_t tcp_close_msg_order = AT_WAITING_FOR_PAYLOAD;

static tcp_send_scratchpad_t send_scratchpad;

static void send_transition(at_tcp_send_builder_order_t state);

static void send_transition(at_tcp_send_builder_order_t state)
{
#if TCP_SEND_FSM_DBG == 1
    dprint("SEND-FSM: [");
    dprint(sendLabels[tcp_send_msg_order]);
    dprint("] -> [");
    dprint(sendLabels[state]);
    dprintln("]");
#endif
    tcp_send_msg_order = state;
}

void tcp_start_at_builder(esp_fsm_scratchpad_t* fsm_ptr, const char* at_cmd)
{
    if (NULL == at_cmd)
    {
#if ESP8266_TCP_HARDCODED == 0
        esp_printf(AT_CMD_TCP_START, fsm_ptr->server, fsm_ptr->port, AT_CMD_EOL);
#else
        esp_printf(AT_CMD_TCP_START, "192.168.253.31", fsm_ptr->port, AT_CMD_EOL);
#endif
    }
}

void tcp_send_at_builder(esp_fsm_scratchpad_t* fsm_ptr, const char* at_cmd)
{
    uint32_t data_len;
    switch(send_scratchpad.order)
    {
    case (BUILDER_SEND_HTTP_PATH):
        send_scratchpad.len = sprintf(send_scratchpad.buffer, "POST %s HTTP/1.1\r\n", fsm_ptr->path);

#if ESP8266_HTTP_DBG == 1
        /* Print request Header */
        dprint(("[HTTP] Header: "));
        dwrite((char*) send_scratchpad.buffer, send_scratchpad.len);
        dprintln();
#endif

        esp_printf(AT_CMD_TCP_SEND, send_scratchpad.len, AT_CMD_EOL);
        send_scratchpad.order = BUILDER_SEND_HTTP_PATH_DATA;
        break;
    case (BUILDER_SEND_HTTP_PATH_DATA):
        ESP8266_UART.write((char*) send_scratchpad.buffer, send_scratchpad.len);
        send_scratchpad.order = BUILDER_SEND_HEADER_HOST;
        break;
    case (BUILDER_SEND_HEADER_HOST):

#if ESP8266_TCP_HARDCODED == 0
        send_scratchpad.len = sprintf(send_scratchpad.buffer, "Host: %s\r\n", fsm_ptr->server);
#else
        send_scratchpad.len = sprintf(send_scratchpad.buffer, "Host: %s\r\n", "192.168.253.31");
#endif

#if ESP8266_HTTP_DBG == 1
        /* Print request Host */
        dprint(("[HTTP] Host: "));
        dwrite((char*) send_scratchpad.buffer, send_scratchpad.len);
        dprintln();
#endif

        esp_printf(AT_CMD_TCP_SEND, send_scratchpad.len, AT_CMD_EOL);
        send_scratchpad.order = BUILDER_SEND_HEADER_HOST_DATA;
        break;
    case (BUILDER_SEND_HEADER_HOST_DATA):
        ESP8266_UART.write((char*) send_scratchpad.buffer, send_scratchpad.len);
        send_scratchpad.order = BUILDER_SEND_HEADER_TOKEN;
        break;
    case (BUILDER_SEND_HEADER_TOKEN):
        send_scratchpad.len = sprintf(send_scratchpad.buffer, "X-ARDUINOTOKEN: %s\r\n", fsm_ptr->token);

#if ESP8266_HTTP_DBG == 1
        /* Print request token */
        dprint(("[HTTP] Token: "));
        dwrite((char*) send_scratchpad.buffer, send_scratchpad.len);
        dprintln();
#endif

        esp_printf(AT_CMD_TCP_SEND, send_scratchpad.len, AT_CMD_EOL);
        send_scratchpad.order = BUILDER_SEND_HEADER_TOKEN_DATA;
        break;
    case (BUILDER_SEND_HEADER_TOKEN_DATA):
        ESP8266_UART.write((char*) send_scratchpad.buffer, send_scratchpad.len);
        send_scratchpad.order = BUILDER_SEND_HEADER_CONTENT_LENGTH;
        break;
    case (BUILDER_SEND_HEADER_CONTENT_LENGTH):
        data_len = strlen(sensorsData_to_urlencodedstring(&fsm_ptr->data));
        send_scratchpad.len = sprintf(send_scratchpad.buffer, "Content-Length: %d\r\n\r\n", data_len);

#if ESP8266_HTTP_DBG == 1
        /* Print request Length */
        dprint(("[HTTP] Length: "));
        dwrite((char*) send_scratchpad.buffer, send_scratchpad.len);
        dprintln();
#endif

        esp_printf(AT_CMD_TCP_SEND, send_scratchpad.len, AT_CMD_EOL);
        send_scratchpad.order = BUILDER_SEND_HEADER_CONTENT_LENGTH_DATA;
        break;
    case (BUILDER_SEND_HEADER_CONTENT_LENGTH_DATA):
        ESP8266_UART.write((char*) send_scratchpad.buffer, send_scratchpad.len);
        send_scratchpad.order = BUILDER_SEND_CONTENT;
        break;
    case (BUILDER_SEND_CONTENT):
        send_scratchpad.len = sprintf(send_scratchpad.buffer, "%s", sensorsData_to_urlencodedstring(&fsm_ptr->data));

#if ESP8266_HTTP_DBG == 1
       /* Print request payload */
        dprint(("[HTTP] Payload: "));
        dwrite((char*) send_scratchpad.buffer, send_scratchpad.len);
        dprintln();
#endif

        esp_printf(AT_CMD_TCP_SEND, send_scratchpad.len, AT_CMD_EOL);
        send_scratchpad.order = BUILDER_SEND_CONTENT_DATA;
        break;
    case (BUILDER_SEND_CONTENT_DATA):
        ESP8266_UART.write((char*) send_scratchpad.buffer, send_scratchpad.len);
        send_scratchpad.order = BUILDER_FINISHED;
        break;
    default:
        /* Do nothing */
        break;
    }

