EmbeddedSystemClass/STM32F746G_Base/ESP8266/App/src/ESP8266_handlers_tcp.cpp
#if ESP8266_TCP_SEND_DBG == 1
    /* Debug data to send */
    switch(send_scratchpad.order)
    {
    case (BUILDER_SEND_HTTP_PATH_DATA):
        dprintln(("\r\n\r\n### HTTP Request start"));
    case (BUILDER_SEND_HEADER_HOST_DATA):
    case (BUILDER_SEND_HEADER_TOKEN_DATA):
    case (BUILDER_SEND_HEADER_CONTENT_LENGTH_DATA):
    case (BUILDER_SEND_CONTENT_DATA):
        dwrite((char*) send_scratchpad.buffer, send_scratchpad.len);
        break;
    case (BUILDER_FINISHED):
        dprintln(("### HTTP Request end\r\n"));
        break;
    default:
        /* Do nothing */
        break;
    }
#endif

}

void tcp_req_time_start(esp_fsm_scratchpad_t* fsm_ptr, const char* at_cmd)
{
    if (NULL == at_cmd)
    {
        esp_printf(AT_CMD_TCP_START, TCP_TIME_SERVER, TCP_TIME_PORT, AT_CMD_EOL);
    }
}

void tcp_req_time_send_at_builder(esp_fsm_scratchpad_t* fsm_ptr, const char* at_cmd)
{
    uint32_t data_len;
    switch(send_scratchpad.order)
    {
    case (BUILDER_SEND_HTTP_PATH):
        send_scratchpad.len = sprintf(send_scratchpad.buffer, "GET %s HTTP/1.1\r\n", "/");

#if ESP8266_HTTP_DBG == 1
        /* Print request Header */
        dprint(("[HTTP] Header: "));
        dwrite((char*) send_scratchpad.buffer, send_scratchpad.len);
        dprintln();
#endif

        esp_printf(AT_CMD_TCP_SEND, send_scratchpad.len, AT_CMD_EOL);
        send_scratchpad.order = BUILDER_SEND_HTTP_PATH_DATA;
        break;
    case (BUILDER_SEND_HTTP_PATH_DATA):
        ESP8266_UART.write((char*) send_scratchpad.buffer, send_scratchpad.len);
        send_scratchpad.order = BUILDER_SEND_HEADER_HOST;
        break;
    case (BUILDER_SEND_HEADER_HOST):
        send_scratchpad.len = sprintf(send_scratchpad.buffer, "Host: %s\r\n", TCP_TIME_SERVER);

#if ESP8266_HTTP_DBG == 1
        /* Print request Host */
        dprint(("[HTTP] Host: "));
        dwrite((char*) send_scratchpad.buffer, send_scratchpad.len);
        dprintln();
#endif

        esp_printf(AT_CMD_TCP_SEND, send_scratchpad.len, AT_CMD_EOL);
        send_scratchpad.order = BUILDER_SEND_HEADER_HOST_DATA;
        break;
    case (BUILDER_SEND_HEADER_HOST_DATA):
        ESP8266_UART.write((char*) send_scratchpad.buffer, send_scratchpad.len);
        send_scratchpad.order = BUILDER_SEND_HEADER_TOKEN;
        break;
    case (BUILDER_SEND_HEADER_TOKEN):
        send_scratchpad.len = sprintf(send_scratchpad.buffer, "User-Agent: %s\r\n", "arduino");

#if ESP8266_HTTP_DBG == 1
        /* Print request Length */
        dprint("[HTTP] TOKEN: ");
        dwrite((char*) send_scratchpad.buffer, send_scratchpad.len);
        dprintln();
#endif

        esp_printf(AT_CMD_TCP_SEND, send_scratchpad.len, AT_CMD_EOL);
        send_scratchpad.order = BUILDER_SEND_HEADER_TOKEN_DATA;
        break;
    case (BUILDER_SEND_HEADER_TOKEN_DATA):
        ESP8266_UART.write((char*) send_scratchpad.buffer, send_scratchpad.len);
        send_scratchpad.order = BUILDER_SEND_HEADER_CONTENT_LENGTH;
        break;
    case (BUILDER_SEND_HEADER_CONTENT_LENGTH):
        send_scratchpad.len = sprintf(send_scratchpad.buffer, "Accept: %s\r\n\r\n", "*/*");

#if ESP8266_HTTP_DBG == 1
        /* Print request Length */
        dprint(("[HTTP] Length: "));
        dwrite((char*) send_scratchpad.buffer, send_scratchpad.len);
        dprintln();
#endif

        esp_printf(AT_CMD_TCP_SEND, send_scratchpad.len, AT_CMD_EOL);
        send_scratchpad.order = BUILDER_SEND_HEADER_CONTENT_LENGTH_DATA;
        break;
    case (BUILDER_SEND_HEADER_CONTENT_LENGTH_DATA):
        ESP8266_UART.write((char*) send_scratchpad.buffer, send_scratchpad.len);
        send_scratchpad.order = BUILDER_FINISHED;
        break;

    default:
        /* Do nothing */
        break;
    }
}

void esp_tcp_setup_mux_handler(esp_fsm_scratchpad_t* fsm_ptr, esp_event_data_t* ev_data_ptr)
{
    switch (ev_data_ptr->ev)
    {
    case (AT_EV_OK):
        esp_fsm_state_transition(ST_FSM_IDLE);
        break;
    case (AT_EV_ERROR):
    case (AT_EV_TIMEOUT):
        esp_fsm_error_handler(fsm_ptr, ev_data_ptr);
        break;
    default:
        esp_fsm_unexpected_event(fsm_ptr, ev_data_ptr);
    }
}

void esp_tcp_start_status_initializer(esp_fsm_scratchpad_t* fsm_ptr)
{
    tcp_start_status_msg_order = AT_WAITING_FOR_PAYLOAD;
}

void esp_tcp_start_status_handler(esp_fsm_scratchpad_t* fsm_ptr, esp_event_data_t* ev_data_ptr)
{
    static uint8_t status = 0;

    switch (ev_data_ptr->ev)
    {
    case (AT_EV_TCP_STATUS):
        if(AT_WAITING_FOR_PAYLOAD == tcp_start_status_msg_order)
        {
            status = ev_data_ptr->data[0];
            tcp_start_status_msg_order = AT_WAITING_FOR_OK;
        }
        else
        {
            esp_fsm_error_handler(fsm_ptr, ev_data_ptr);
        }
        break;
    case (AT_EV_OK):
        if(AT_WAITING_FOR_OK == tcp_start_status_msg_order)
        {
            tcp_start_status_msg_order = AT_WAITING_FINISHED;

            /*
             * <stat> status of ESP8266 station interface
             * 2 : ESP8266 station connected to an AP and has obtained IP
             * 3 : ESP8266 station created a TCP or UDP transmission
             * 4 : the TCP or UDP transmission of ESP8266 station disconnected
             * 5 : ESP8266 station did NOT connect to an AP
             */

            if(3 == status)
            {
                esp_fsm_state_transition(ST_TCP_SEND_WAIT);
            }
            else
            {
                esp_fsm_state_transition(ST_FSM_IDLE);
            }
        }
        else
        {
            esp_fsm_error_handler(fsm_ptr, ev_data_ptr);
        }
        break;
    case (AT_EV_ERROR):
    case (AT_EV_TIMEOUT):
        esp_fsm_error_handler(fsm_ptr, ev_data_ptr);
        break;
    default:
        esp_fsm_unexpected_event(fsm_ptr, ev_data_ptr);
    }
}

void esp_tcp_close_status_initializer(esp_fsm_scratchpad_t* fsm_ptr)
{
    tcp_close_status_msg_order = AT_WAITING_FOR_PAYLOAD;
}

void esp_tcp_close_status_handler(esp_fsm_scratchpad_t* fsm_ptr, esp_event_data_t* ev_data_ptr)
{
    static uint8_t status = 0;

    switch (ev_data_ptr->ev)
    {
    case (AT_EV_TCP_STATUS):
        if(AT_WAITING_FOR_PAYLOAD == tcp_close_status_msg_order)
        {
            status = ev_data_ptr->data[0];
            tcp_close_status_msg_order = AT_WAITING_FOR_OK;
        }
        else
        {
            esp_fsm_error_handler(fsm_ptr, ev_data_ptr);
        }
        break;
    case (AT_EV_OK):
        if(AT_WAITING_FOR_OK == tcp_close_status_msg_order)
        {
            tcp_close_status_msg_order = AT_WAITING_FINISHED;

