EmbeddedSystemClass/STM32F746G_Base/ESP8266/App/src/ESP8266_handlers_tcp.cpp
            /*
             * <stat> status of ESP8266 station interface
             * 2 : ESP8266 station connected to an AP and has obtained IP
             * 3 : ESP8266 station created a TCP or UDP transmission
             * 4 : the TCP or UDP transmission of ESP8266 station disconnected
             * 5 : ESP8266 station did NOT connect to an AP
             */

            if(4 == status)
            {
                esp_fsm_state_transition(ST_FSM_IDLE);
            }
            else
            {
                esp_fsm_state_transition(ST_TCP_CLOSE);
            }
        }
        else
        {
            esp_fsm_error_handler(fsm_ptr, ev_data_ptr);
        }
        break;
    case (AT_EV_ERROR):
    case (AT_EV_TIMEOUT):
        esp_fsm_error_handler(fsm_ptr, ev_data_ptr);
        break;
    default:
        esp_fsm_unexpected_event(fsm_ptr, ev_data_ptr);
    }
}

void esp_tcp_start_initializer(esp_fsm_scratchpad_t* fsm_ptr)
{
    tcp_start_msg_order = AT_WAITING_FOR_PAYLOAD;
    send_scratchpad.order = BUILDER_SEND_HTTP_PATH;

#if 0
    dprintfln("[HTTP] Data to send: %s", sensorsData_to_urlencodedstring(&fsm_ptr->data));
#endif

}

void esp_tcp_start_handler(esp_fsm_scratchpad_t* fsm_ptr, esp_event_data_t* ev_data_ptr)
{
    switch (ev_data_ptr->ev)
    {
    case (AT_EV_TCP_CONNECT):
    case (AT_EV_TCP_ALREADY_CONNECT):
        if(AT_WAITING_FOR_PAYLOAD == tcp_start_msg_order)
        {
            tcp_start_msg_order = AT_WAITING_FOR_OK;
        }
        else
        {
            esp_fsm_error_handler(fsm_ptr, ev_data_ptr);
        }
        break;
    case (AT_EV_OK):
        if(AT_WAITING_FOR_OK == tcp_start_msg_order)
        {
            tcp_start_msg_order = AT_WAITING_FINISHED;
            esp_fsm_state_transition(ST_TCP_START_STAT);
        }
        else
        {
            esp_fsm_error_handler(fsm_ptr, ev_data_ptr);
        }
        break;
    case (AT_EV_TCP_CLOSED):
        /* Do nothing */
        break;
    case (AT_EV_ERROR):
        esp_fsm_error_handler(fsm_ptr, ev_data_ptr);
        break;
    case (AT_EV_TIMEOUT):
        esp_fsm_state_transition(ST_FSM_IDLE);
        break;
    default:
        esp_fsm_unexpected_event(fsm_ptr, ev_data_ptr);
    }
}

void esp_tcp_send_initializer(esp_fsm_scratchpad_t* fsm_ptr)
{
    tcp_send_msg_order = AT_SEND_WAIT_FOR_OK;
}

void esp_tcp_send_handler(esp_fsm_scratchpad_t* fsm_ptr, esp_event_data_t* ev_data_ptr)
{
    switch (ev_data_ptr->ev)
    {
    case (AT_EV_OK):
        if(AT_SEND_WAIT_FOR_OK == tcp_send_msg_order)
        {
            send_transition(AT_SEND_WAIT_CURSOR);
        }
        else
        {
            esp_fsm_error_handler(fsm_ptr, ev_data_ptr);
        }
        break;
    case (AT_EV_TCP_CURSOR):
        if(AT_SEND_WAIT_CURSOR == tcp_send_msg_order)
        {
            tcp_send_at_builder(fsm_ptr, NULL);
            send_transition(AT_SEND_WAIT_SENDOK);
        }
        else
        {
            esp_fsm_error_handler(fsm_ptr, ev_data_ptr);
        }
        break;
    case (AT_EV_TCP_SENDOK):
        if(AT_SEND_WAIT_SENDOK == tcp_send_msg_order)
        {
            if(BUILDER_FINISHED == send_scratchpad.order)
            {
                esp_fsm_state_transition(ST_TCP_RECEIVE);
            }
            else
            {
                esp_fsm_state_transition(ST_TCP_SEND_WAIT);
            }

            send_transition(AT_SEND_FINISHED);
        }
        else
        {
            esp_fsm_error_handler(fsm_ptr, ev_data_ptr);
        }
        break;
    case (AT_EV_TCP_CLOSED):
        /* Do nothing, If TCP connection gets closed we will receive an error response shortly */
        break;
    case (AT_EV_TCP_SEND_ERROR):
        esp_fsm_state_transition(ST_TCP_CLOSE_STAT);
        break;
    case (AT_EV_ERROR):
    case (AT_EV_TIMEOUT):
        esp_fsm_error_handler(fsm_ptr, ev_data_ptr);
        break;
    default:
        esp_fsm_unexpected_event(fsm_ptr, ev_data_ptr);
    }
}

void esp_tcp_send_wait_handler(esp_fsm_scratchpad_t* fsm_ptr, esp_event_data_t* ev_data_ptr)
{
    switch (ev_data_ptr->ev)
    {
    case (AT_EV_TIMEOUT):
        esp_fsm_state_transition(ST_TCP_SEND);
        break;
    case (AT_EV_ERROR):
        esp_fsm_error_handler(fsm_ptr, ev_data_ptr);
        break;
    default:
        esp_fsm_unexpected_event(fsm_ptr, ev_data_ptr);
    }
}

void esp_tcp_close_initializer(esp_fsm_scratchpad_t* fsm_ptr)
{
    tcp_close_msg_order = AT_WAITING_FOR_PAYLOAD;
    send_scratchpad.order = BUILDER_FINISHED;
}

void esp_tcp_close_handler(esp_fsm_scratchpad_t* fsm_ptr, esp_event_data_t* ev_data_ptr)
{
    switch (ev_data_ptr->ev)
    {
    case (AT_EV_TCP_CLOSED):
        if(AT_WAITING_FOR_PAYLOAD == tcp_close_msg_order)
        {
            tcp_close_msg_order = AT_WAITING_FOR_OK;
        }
        else
        {
            esp_fsm_error_handler(fsm_ptr, ev_data_ptr);
        }
        break;
    case (AT_EV_OK):
        if(AT_WAITING_FOR_OK == tcp_close_msg_order)
        {
            tcp_close_msg_order = AT_WAITING_FINISHED;
            esp_fsm_state_transition(ST_FSM_IDLE);
        }
        else
        {
            esp_fsm_error_handler(fsm_ptr, ev_data_ptr);
        }
        break;
    case (AT_EV_TCP_IPD):
        /* TODO: Check this case when more than one +IPD message is received */
        /* Ignore this event */
        break;
    case (AT_EV_ERROR):
        /* TCP connection may have been closed before */
        esp_fsm_state_transition(ST_FSM_IDLE);
        break;
    case (AT_EV_TIMEOUT):
        esp_fsm_error_handler(fsm_ptr, ev_data_ptr);
        break;
    default:
        esp_fsm_unexpected_event(fsm_ptr, ev_data_ptr);
    }
}

void esp_tcp_receive_handler (esp_fsm_scratchpad_t* fsm_ptr, esp_event_data_t* ev_data_ptr)
{
    int16_t httpStatus = -1;
    switch (ev_data_ptr->ev)
    {
    case (AT_EV_TCP_IPD):
    {
        httpStatus = *(int16_t *) &ev_data_ptr->data;
        dprintfln("[HTTP] Status: %d", httpStatus);
        if ((201 == httpStatus) || (200 == httpStatus))
        {
            if (markLogAsSent(fsm_ptr->log_idx))
            {
                resetLogFile();
            }

