EmbeddedSystemClass/STM32F746G_Base/ESP8266/App/src/ESP8266_handlers_tcp.cpp
            /* Close connection */
            esp_fsm_state_transition(ST_TCP_CLOSE_STAT);
        }
        else
        {
            esp_fsm_state_transition(ST_FSM_IDLE);
        }
        break;
    }
    case (AT_EV_ERROR):
    case (AT_EV_TIMEOUT):
        esp_fsm_state_transition(ST_TCP_CLOSE_STAT);
        break;
    }
}

void esp_tcp_req_time_initializer(esp_fsm_scratchpad_t* fsm_ptr)
{
    tcp_start_msg_order = AT_WAITING_FOR_PAYLOAD;
    send_scratchpad.order = BUILDER_SEND_HTTP_PATH;
}

void esp_tcp_req_time_handler (esp_fsm_scratchpad_t* fsm_ptr, esp_event_data_t* ev_data_ptr)
{
    switch (ev_data_ptr->ev)
    {
    case (AT_EV_TCP_CONNECT):
    case (AT_EV_TCP_ALREADY_CONNECT):
        if(AT_WAITING_FOR_PAYLOAD == tcp_start_msg_order)
        {
            tcp_start_msg_order = AT_WAITING_FOR_OK;
        }
        else
        {
            esp_fsm_error_handler(fsm_ptr, ev_data_ptr);
        }
        break;
    case (AT_EV_OK):
        if(AT_WAITING_FOR_OK == tcp_start_msg_order)
        {
            tcp_start_msg_order = AT_WAITING_FINISHED;
            esp_fsm_state_transition(ST_TCP_REQ_TIME_SEND_WAIT);
        }
        else
        {
            esp_fsm_error_handler(fsm_ptr, ev_data_ptr);
        }
        break;
    case (AT_EV_TCP_CLOSED):
        /* Do nothing */
        break;
    case (AT_EV_ERROR):
        esp_fsm_error_handler(fsm_ptr, ev_data_ptr);
        break;
    case (AT_EV_TIMEOUT):
        esp_fsm_state_transition(ST_FSM_IDLE);
        break;
    default:
        esp_fsm_unexpected_event(fsm_ptr, ev_data_ptr);
    }
}

void esp_tcp_req_time_send_wait_handler (esp_fsm_scratchpad_t* fsm_ptr, esp_event_data_t* ev_data_ptr)
{
    switch (ev_data_ptr->ev)
    {
    case (AT_EV_TIMEOUT):
        esp_fsm_state_transition(ST_TCP_REQ_TIME_SEND);
        break;
    case (AT_EV_ERROR):
        esp_fsm_error_handler(fsm_ptr, ev_data_ptr);
        break;
    default:
        esp_fsm_unexpected_event(fsm_ptr, ev_data_ptr);
    }
}

void esp_tcp_req_time_send_initializer(esp_fsm_scratchpad_t* fsm_ptr)
{
    tcp_send_msg_order = AT_SEND_WAIT_FOR_OK;
}

void esp_tcp_req_time_send_handler (esp_fsm_scratchpad_t* fsm_ptr, esp_event_data_t* ev_data_ptr)
{
    switch (ev_data_ptr->ev)
    {
    case (AT_EV_OK):
        if(AT_SEND_WAIT_FOR_OK == tcp_send_msg_order)
        {
            send_transition(AT_SEND_WAIT_CURSOR);
        }
        else
        {
            esp_fsm_error_handler(fsm_ptr, ev_data_ptr);
        }
        break;
    case (AT_EV_TCP_CURSOR):
        if(AT_SEND_WAIT_CURSOR == tcp_send_msg_order)
        {
            tcp_req_time_send_at_builder(fsm_ptr, NULL);
            send_transition(AT_SEND_WAIT_SENDOK);
        }
        else
        {
            esp_fsm_error_handler(fsm_ptr, ev_data_ptr);
        }
        break;
    case (AT_EV_TCP_SENDOK):
        if(AT_SEND_WAIT_SENDOK == tcp_send_msg_order)
        {
            if(BUILDER_FINISHED == send_scratchpad.order)
            {
                esp_fsm_state_transition(ST_TCP_REQ_TIME_RECEIVE);
            }
            else
            {
                esp_fsm_state_transition(ST_TCP_REQ_TIME_SEND_WAIT);
            }
            send_transition(AT_SEND_FINISHED);
        }
        else
        {
            esp_fsm_error_handler(fsm_ptr, ev_data_ptr);
        }
        break;
    case (AT_EV_TCP_CLOSED):
        /* Do nothing, If TCP connection gets closed we will receive an error response shortly */
        break;
    case (AT_EV_TCP_SEND_ERROR):
        esp_fsm_state_transition(ST_TCP_CLOSE);
        break;
    case (AT_EV_ERROR):
    case (AT_EV_TIMEOUT):
        esp_fsm_error_handler(fsm_ptr, ev_data_ptr);
        break;
    default:
        esp_fsm_unexpected_event(fsm_ptr, ev_data_ptr);
    }
}

void esp_tcp_req_time_recv_handler (esp_fsm_scratchpad_t* fsm_ptr, esp_event_data_t* ev_data_ptr)
{
    Time *timePtr = NULL;
    uint32_t epoch, prev_epoch, difference;
    switch (ev_data_ptr->ev)
    {
    case (AT_EV_TIME):
    {
        timePtr = (Time *)(*(uint32_t *)(&ev_data_ptr->data[0]));
        if (NULL != timePtr)
        {
            prev_epoch = unixEpoch();
            epoch = makeUnix(timePtr);
            if (epoch != 0)
            {
                difference = ((epoch > prev_epoch) ? (epoch - prev_epoch) : (prev_epoch - epoch));
                if (difference > WEB_RTC_MIN_DIFF)
                {
                    if (syncRTC(timePtr))
                    {
                        dprint("RTC updated correctly\r\n");
                    }
                }
                else
                {
                    dprint("No RTC sync needed\r\n");
                }
            }
            else
            {
                dprint("Invalid epoch (Zero value)\r\n");
            }

#if (ESP8266_AT_PARSER_DBG == 1)
            dprintf("Day of Week: %s\r\n",  timePtr->dow == 1 ? "Mon" :
                                            timePtr->dow == 2 ? "Tue" :
                                            timePtr->dow == 3 ? "Wed" :
                                            timePtr->dow == 4 ? "Thu" :
                                            timePtr->dow == 5 ? "Fri" :
                                            timePtr->dow == 6 ? "Sat" :
                                            timePtr->dow == 7 ? "Sun" : "Inv");
            dprintf("Date: %d\r\n", timePtr->date);
            dprintf("Month: %s\r\n",    timePtr->mon == 1 ? "Jan" :
                                        timePtr->mon == 2 ? "Feb" :
                                        timePtr->mon == 3 ? "Mar" :
                                        timePtr->mon == 4 ? "Apr" :
                                        timePtr->mon == 5 ? "May" :
                                        timePtr->mon == 6 ? "Jun" :
                                        timePtr->mon == 7 ? "Jul" :
                                        timePtr->mon == 8 ? "Aug" :
                                        timePtr->mon == 9 ? "Sep" :
                                        timePtr->mon == 10 ? "Oct" :
                                        timePtr->mon == 11 ? "Nov" :
                                        timePtr->mon == 12 ? "Dec" : "Inv");
            dprintf("Year: %d\r\n", timePtr->year);
            dprintf("Hour: %d:%d:%d\r\n", timePtr->hour, timePtr->min,timePtr->sec);
#endif
        }
        esp_fsm_state_transition(ST_FSM_IDLE);
        break;
    }
    case (AT_EV_ERROR):
    case (AT_EV_TIMEOUT):
        esp_fsm_state_transition(ST_TCP_CLOSE);
        break;
    }
}


